[NoCoverage] BlockStatement
src/server.js:10:34
 app.use(bodyParser.json());
 app.use(bodyParser.urlencoded());
 
-app.get('/health', (req, res) => {
-  res.json({ message: 'hello world' });
-});
+app.get('/health', (req, res) => {});
 
 app.post('/calc', (req, res) => {

[NoCoverage] BlockStatement
src/server.js:14:33
   res.json({ message: 'hello world' });
 });
 
-app.post('/calc', (req, res) => {
-  const { numOne, numTwo } = req.body;
-
-  const result = calcUsecaseExecute(numOne, numTwo);
-
-  res.json({ result });
-});
+app.post('/calc', (req, res) => {});
 
 app.listen(3000, () => console.log('server started on port 3000'));

[NoCoverage] ObjectLiteral
src/server.js:19:12
 
   const result = calcUsecaseExecute(numOne, numTwo);
 
-  res.json({ result });
+  res.json({});
 });
 

[NoCoverage] ArrowFunction
src/server.js:22:18
   res.json({ result });
 });
 
-app.listen(3000, () => console.log('server started on port 3000'));
+app.listen(3000, () => undefined);
 

[NoCoverage] StringLiteral
src/server.js:22:36
   res.json({ result });
 });
 
-app.listen(3000, () => console.log('server started on port 3000'));
+app.listen(3000, () => console.log(""));
 
