[Killed] BlockStatement
src/calc-usecase.js:1:47
-module.exports.calcUsecaseExecute = (x, y) => {
-  if (x && y) {
-    return x + y;
-  }
-
-  throw new Error('invalid values');
-};
+module.exports.calcUsecaseExecute = (x, y) => {};
 
killedBy: calc-usecase suit tests should be return the sum of two values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/calc-usecase.js:2:7
 module.exports.calcUsecaseExecute = (x, y) => {
-  if (x && y) {
+  if (false) {
     return x + y;
   }
killedBy: calc-usecase suit tests should be return the sum of two values
statusReason: Error: invalid values

[Killed] ConditionalExpression
src/calc-usecase.js:2:7
 module.exports.calcUsecaseExecute = (x, y) => {
-  if (x && y) {
+  if (true) {
     return x + y;
   }
killedBy: calc-usecase suit tests should be return exception error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "invalid values"

Received function did not throw

[Killed] ArithmeticOperator
src/calc-usecase.js:3:12
 module.exports.calcUsecaseExecute = (x, y) => {
   if (x && y) {
-    return x + y;
+    return x - y;
   }
 
killedBy: calc-usecase suit tests should be return the sum of two values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1
